add workflow diagram
